# 对于python来说一切都是对象。
# OOP  object oriented programming

# 程序扩展性更好、可读性更强，面向对象思想中，数据和操作数据的函数封装到对象内，组织代码和数据的方式更接近于人的思维。

# python支持面向过程(微观的具体实现)、面向对象(宏观的构思与抽象)、函数式编程。

# 1.什么是面向过程---解决一个问题，先把它分步，然后写出函数算法解决这个问题。

# 2.什么是面向对象---怎么造出一个"xx"

# "xx"的创造是复杂而令人无头绪的，我们将它造出来，需要构思里面有什么内容，它有什么存在的内容，分别有什么功能，抽象出其具体的存在内容。

# 比如：造一个汽车，汽车由什么构成，发动机、轮子、玻璃、座椅等等等。

# 但是具体的'构成，发动机、轮子、玻璃'的功能实现，要分别以面向过程的思想进行分析。

'''
值得一提的是,面向对象思想的提出也是一个量变产生质变的方法,要重视量的逐渐变化，慢慢积累


最开始:计算机存储的是10 20 30这种的数据

接下来我们使用数组：[10 20 30 40 50 60 70]同类型的更多数据

C++的结构体:struct{容纳更多类型的数据}

C++的面向对象:容纳更多数据的同时,将操作这些数据的函数方法也放进对象内。

'''