# python中的库该如何使用，库可以是模块的集合，对外发布出去我们就称别人的包叫做库或者包，是一个广泛的称呼，可以通俗理解为包。

# 我们如果对于其它的人的包和模块如何使用别人的包.

'''
<1> python自身库
    python的自身核心只包含了数字、字符串、列表、字典、文件等常见类型和函数。

<2>python标准库(Standard Library)----------------python强大的基础。
    python的标准库十分强大,提供了系统管理,网络通信,文本处理,数据库接口,图形接口,xml等功能。

    文本处理:涉及文本的格式化\正则表达式匹配\文本的差异计算和合并\Unicode支持\二进制数据的处理功能
    
    文件处理：文件操作、创建临时文件、文件压缩和归档、操作配置文件等功能。
    
    操作系统功能:线程、进程。IO复用、日期与时间的处理、调用系统的函数、日志等功能。
    
    网络通信:网络套接字、SSL加密通信、异步网络通信等功能
    
    网络协议:HTTP,FTP,SMTP,POP.IMAP,NNTP,XMLRPC等多种网络协议,还提供了编写网络服务器的框架.

    W3C格式支持:HTML\SGML.XML的处理
    
    其它的功能:国际化、数字、HASH、Tkinter等。

<3>python社区提供的各种第三方的强大库。------------------python生态逐渐壮大的保证。

    我们了解之后可以利用数十万个,其它人造好的轮子,来完成我们自己的项目。
    PyPI的官网:http://pypi.org
    
    如何写好自己的项目发布到官网后来让大家使用的教程需要自己去了解.
    
    几乎各行各业各个领域的库都被不同的库所发掘,我们可以逐渐深入到某个领域,学习某个库来壮大我们的项目能力.
'''